[BITS 16]
[ORG 0x7C00]  ; Завантажувач починається з цієї адреси в пам'яті

start:
wait_key:
    xor ah, ah           ; Очікування натискання клавіші
    int 0x16             ; Виклик BIOS для отримання коду натиснутої клавіші
    cmp al, 0x1B         ; Перевірка, чи була натиснута клавіша Esc (код 0x1B)
    je exit              ; Вихід, якщо Esc
    cmp al, 0x20         ; Перевіряємо, чи це символ для друку
    jb wait_key          ; Пропустити все, що не є символом
    cmp al, 0x7F         ; Пропустити все, що за межами ASCII
    ja wait_key
    mov ah, 0x0E
    int 0x10             ; Вивести символ
    jmp wait_key         ; Повторити очікування вводу

exit:
    cli                  ; Заборонити переривання
    hlt                  ; Завершити виконання

times 510-($-$$) db 0    ; Заповнити нулями до 510 байтів
dw 0xAA55               ; Завантажувальний підпис (boot signature)
